MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK10DN128VMP5/mcu.h
#define PREAMBLE                      0x00007F80      // CEA709.1-B Preamble Register
#define PREAMBLE                      0x00007F80      // CEA709.1-B Preamble Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TPL register.
//
//*****************************************************************************

#define TPL                           0x00007F80      // Transmit Packet Length Register
#define TPL                           0x00007F80      // Transmit Packet Length Register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_IE register.
//
//*****************************************************************************

#define WBEIE                         0x00000080      // WBASE Expired Interrupt Enable
#define ISDIE                         0x00000040      // Initial Sync Detection Interrupt Enable
#define PRXIE                         0x00000020      // Packet Received Interrupt Enable
#define PTXIE                         0x00000010      // Packet Transmitted Interrupt Enable
#define PCTEIE                        0x00000008      // Packet Cycle Timer Interrupt Enable
#define PSIE                          0x00000004      // Preamble Start Interrupt Enable
#define TXFIE                         0x00000002      // Transmission Fail Interrupt Enable
#define WBEIE                         0x00000040      // WBASE Expired Interrupt Enable
#define ISDIE                         0x00000020      // Initial Sync Detection Interrupt Enable
#define PRXIE                         0x00000010      // Packet Received Interrupt Enable
#define PTXIE                         0x00000008      // Packet Transmitted Interrupt Enable
#define PCTEIE                        0x00000004      // Packet Cycle Timer Interrupt Enable
#define PSIE                          0x00000002      // Preamble Start Interrupt Enable
#define TXFIE                         0x00000001      // Transmission Fail Interrupt Enable
#define WBEIE                         0x00000040      // WBASE Expired Interrupt Enable
#define ISDIE                         0x00000020      // Initial Sync Detection Interrupt Enable
#define PRXIE                         0x00000010      // Packet Received Interrupt Enable
#define PTXIE                         0x00000008      // Packet Transmitted Interrupt Enable
#define PCTEIE                        0x00000004      // Packet Cycle Timer Interrupt Enable
#define PSIE                          0x00000002      // Preamble Start Interrupt Enable
#define TXFIE                         0x00000001      // Transmission Fail Interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S3 register.
//
//*****************************************************************************

#define PEF                           0x00000080      // Preamble Error Flag
#define WBEF                          0x00000040      // Wbase Expired Flag
#define ISD                           0x00000020      // Initial Sync Detect
#define PRXF                          0x00000010      // Packet Received Flag
#define PTXF                          0x00000008      // Packet Transmitted Flag
#define PCTEF                         0x00000004      // Packet Cycle Timer Expired Flag
#define PSF                           0x00000002      // Preamble Start Flag
#define TXFF                          0x00000001      // Transmission Fail Flag
#define PEF                           0x00000080      // Preamble Error Flag
#define WBEF                          0x00000040      // Wbase Expired Flag
#define ISD                           0x00000020      // Initial Sync Detect
#define PRXF                          0x00000010      // Packet Received Flag
#define PTXF                          0x00000008      // Packet Transmitted Flag
#define PCTEF                         0x00000004      // Packet Cycle Timer Expired Flag
#define PSF                           0x00000002      // Preamble Start Flag
#define TXFF                          0x00000001      // Transmission Fail Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_S4 register.
//
//*****************************************************************************

#define INITF                         0x00000010      // Initial Synchronization Fail Flag
#define CDET                          0x00000018      // CDET
#define ILCV                          0x00000002      // Improper Line Code Violation
#define FE                            0x00000001      // Framing Error
#define ILCV                          0x00000002      // Improper Line Code Violation
#define INITF                         0x00000010      // Initial Synchronization Fail Flag
#define CDET                          0x00000018      // CDET
#define ILCV                          0x00000002      // Improper Line Code Violation
#define FE                            0x00000001      // Framing Error


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPL register.
//
//*****************************************************************************

#define RPL                           0x00007F80      // Received Packet Length
#define RPL                           0x00007F80      // Received Packet Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RPREL register.
//
//*****************************************************************************

#define RPREL                         0x00007F80      // Received Preamble Length
#define RPREL                         0x00007F80      // Received Preamble Length


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_CPW register.
//
//*****************************************************************************

#define CPW                           0x00007F80      // CEA709.1-B CPW register
#define CPW                           0x00007F80      // CEA709.1-B CPW register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_RIDT register.
//
//*****************************************************************************

#define RIDT                          0x00007F80      // CEA709.1-B Receive IDT register
#define RIDT                          0x00007F80      // CEA709.1-B Receive IDT register


//*****************************************************************************
//
// The following are defines for the bit fields in the UARTx_TIDT register.
//
//*****************************************************************************

